# 관련 명령어들

**1) RIP 설정**Router(config)# **router rip**

- 이 라우터에서 RIP를 사용하겠다는 의미

**2) 네트워크 지정**

Router(config-router)# **network (network-number)**

- network-number 로 지정된 네트워크를 RIP 라우팅에 참여시킴주의: RIP는 Classfull 하게 네트워크를 인식하므로, 서브넷이 무의미함

**(예)**Router(config-router)# **network 150.150.100.0**Router(config-router)# endRouter# show running-config

**[Output]**!router ripnetwork 150.150.0.0!

- B 클래스 주소를 서브넷팅(classless)해서 사용하고자 이렇게 입력해도결과는 위에서 보이는 것처럼, B 클래스(classful)로 나타남 -> RIP의 특성

**3) 현재 사용중인 프로토콜 정보 확인**Router# **show ip protocol**

**4) 라우팅 테이블 확인**

Router# **show ip route**

**5) 라우터 디버그 실행**- 라우터에서 주고 받는 정보들 확인- 라우터에 상당한 부담을 주므로, 가능한 조금만 사용하고, 보고 난 후에는 반드시

디버그 기능을 꺼 줘야 함

Router# **debug ip rip**

**[참고]**Router# **terminal monitor*** 텔넷에서 디버그 결과를 확인하려면 이 명령어를 먼저 수행

(그치만 테스트 해볼때는, 이 명령어 없이도 잘 되던걸..^^;;;;;)

**6) 디버그 기능 끄기**

Router# **no debug all**

**[OR]**

Router# **undebug all**

**[TIP]**

디버그화면이 빠르게 지나가기 때문에, 끄는 명령을 사용하기가 쉽지않기에,

u al 로 이용하는 것이 유용.

Router# **u al**

### **Practice**

**Question) PC A와 PC B간에 있는 라우터를 RIP로 구성해서**

**두 PC가 통신이 되도록 해보자.**

- **Topology ***

**(Answer)**

**[Router A]**

**// 기본 인터페이스 설정 사항들**

Router# conf tRouter(config)# hostname Router_ARouter_A(config)# int e 0Router_A(config-if)# no shutRouter_A(config-if)# ip address 210.240.10.1 255.255.255.0Router_A(config-if)# exit

Router_A(config)# int s 0Router_A(config-if)# no shutRouter_A(config-if)# ip address 203.210.100.1 255.255.255.0Router_A(config-if)# clock rate 125000Router_A(config-if)# exit

Router_A(config)# int s 1Router_A(config-if)# no shutRouter_A(config-if)# ip address 203.210.200.1 255.255.255.0Router_A(config-if)# clock rate 1000000Router_A(config-if)# exit

**// RIP 설정**

Router_A(config)# router ripRouter_A(config-router)# network 203.210.100.0Router_A(config-router)# network 203.210.200.0Router_A(config-router)# network 210.240.10.0Router_A(config-router)# end

Router_A# sh runRouter_A# sh ip ro

**[Router B]**

Router# conf tRouter(config)# hostname Router_B

Router_B(config)# int e 0Router_B(config-if)# no shutRouter_B(config-if)# ip address 172.70.100.1 255.255.255.0Router_B(config-if)# exit

Router_B(config)# int s 0Router_B(config-if)# no shutRouter_B(config-if)# ip address 203.210.100.1 255.255.255.0Router_B(config-if)# exit

Router_B(config)# router ripRouter_B(config-router)# network 203.210.100.0Router_B(config-router)# network 172.70.0.0Router_B(config-router)# end

Router_B# sh runRouter_B# sh ip ro

**[Router C]**Router# conf tRouter(config)# hostname Router_CRouter_C(config)# int e 0Router_C(config-if)# no shutRouter_C(config-if)# ip address 150.150.1.1 255.255.0.0Router_C(config-if)# exit

Router_C(config)# int s 0Router_C(config-if)# no shutRouter_C(config-if)# ip address 203.210.200.2 255.255.255.0Router_C(config-if)# exit

Router_C(config)# router ripRouter_C(config-router)# network 203.210.200.0Router_C(config-router)# network 150.150.0.0Router_C(config-router)# end

Router_C# sh runRouter_C# sh ip ro

**// telnet 설정**Router_C# conf tRouter_C(config)# line vty 0 4Router_C(config-line)# loginRouter_C(config-line)# password sjyRouter_C(config-line)# end

**[Switch B]**

Switch#Switch# conf tSwitch(config)# hostname SW_B

SW_B(config)# int vlan 1SW_B(config-if)# no shutSW_B(config-if)# ip address 172.70.100.10 255.255.255.0SW_B(config-if)# exit

SW_B(config)# ip default-gateway 172.70.100.1SW_B(config)# exit

SW_C# show ip int brief

**[Switch C]**

Switch#Switch# conf tSwitch(config)# hostname SW_C

SW_C(config)# int vlan 1SW_C(config-if)# no shutSW_C(config-if)# ip address 150.150.1.10 255.255.0.0SW_C(config-if)# exit

SW_C(config)# ip default-gateway 150.150.1.1SW_C(config)# exit

SW_C# show ip int briefSW_C# ping 172.70.100.11

**[PC-A]**

**// IP와 게이트웨이 설정**c:> ipconfig /ip 150.150.1.11 255.255.0.0c:> ipconfig /dg 150.150.1.1

**// 각종 테스트**

c:> ping 150.150.1.1c:> ping 203.210.200.2c:> ping 172.70.100.1c:> ping 172.70.100.11

**// 텔넷으로 라우터 디버그 모드 Test**c:> telnet 203.210.200.2password:

Router_C> enRouter_C# **debug ip rip**Router_C# **u all**

**[PC-B]**

c:> ipconfig /ip 172.70.100.11 255.255.255.0c:> ipconfig /dg 172.70.100.1

**[Note]**  **스태틱 라우트 구1) Administrative Distance : 1**Router_A(config)# ip route 150.150.0.0 255.255.0.0 203.240.200.2

**2) Administrative Distance : 0**Router_A(config)# ip route 150.150.0.0 255.255.0.0 serial 0/1

- 라우팅을 설정할때 위처럼, 인터페이스를 직접 지정해주면, distance 값이 0으로 표시 됨을 확인할 수 있다 (sh ip ro 이용)
- distance 값이 작을 수록 경로 선정시 우선권이 부여.

**참고**

**1) Back to Back 구성이란?**실제 라우터 구성에서 쓰이는, DSU/CSU 장비 대신, V.35 DTE/DCE 장비를 이용한 구성

(주로 실습 환경 용)

**2) 확인방법?**

Router# show controller serial 0

- 결과 화면 2째줄에서 DCE 인지, DTE 인지 확인 가능.

**3) 세팅**

Router_DCE# conf tRouter_DCE(config)# int s 0Router_DCE(config-if)# clock rate 56000

***세팅 설명**

- DCE 장비는 clock를 제공해야 하므로, DCE케이블이 연결된 라우터에 들어가서,

위의 세팅을 반드시 해줘야만 한다. 그래야만, 이 두 장비(DTE/DCE)가 통신할 때

설정된 clockrate(56kbps)로 통신 할 수 있기 때문이다.

- clock rate 가 설정되지 않으면, 라우터간 통신이 안된다.

출처:

[https://jvinci.tistory.com/22](https://jvinci.tistory.com/22)